//ACS_DO2(Дистанционный, "Дистанционный" )
ACS_DO2(Авария, "Авария" )
//ACS_DO2(Готовность, "Готовность" )
//
ACS_DI2(Пуск, "Пуск" )
ACS_DI2(Стоп, "Стоп" )
//ACS_DI2(Пуск_2, "Пуск_2" )
ACS_DI2(Стоп_2, "Стоп_Р" )
ACS_DI2(Пуск_Стоп, "Пуск/Стоп" )
//ACS_DI2(Пуск_разрешен, "Разрешение_пуска" )
//ACS_DI2(Запрет_пуска, "Запрет пуска" )
//ACS_DO(Дистанционное_управление,"Дистанционное_управление","Переключатель в поле")
//
ACS_DO2(Работает, "Состояние" )
ACS_AO2(Обороты, "Обороты" )
ACS_AO2(Ток,"Ток")
ACS_AO2(Мощность, "Мощность" )
ACS_AI(Задание, "Задание", "Заданнные обороты (0-100)" )
//ACS_AO2(Думис,"Думис")


INT_REG( Reg_Press_out, "Давление на выкиде(и)" ) 
INT_REG( Reg_T_out, "Температура на выкиде" ) 
