ACS_AO2(Ток,"Ток")
//
//ACS_AO2(T_gas_in,"Т газа на входе")
//ACS_AO2(T_gas_out,"Т газа на выходе")
//
ACS_DO2(Работает, "Состояние" )
ACS_AO2(Обороты, "Обороты" )
//
ACS_DI2(Пуск, "Пуск" )
ACS_DI2(Стоп, "Стоп" )
//ACS_DI2(Пуск_2, "Пуск_2" )
ACS_DI2(Стоп_2, "Стоп_Р" )
ACS_DI2(Пуск_стоп, "Пуск_стоп" )

//ACS_DI2(Разрешение_пуска, "Разрешение_пуска" )
//ACS_DO(Дистанционное_управление,"Дистанционное_управление","Переключатель в поле")

ACS_DO2(Авария,"Авария")
//ACS_DO2(Загрузка_0,"Загрузка_0")
//ACS_DO2(Загрузка_25,"Загрузка_25")
//ACS_DO2(Загрузка_50,"Загрузка_50")
//ACS_DO2(Загрузка_75,"Загрузка_75")
//ACS_DO2(Загрузка_100,"Загрузка_100")
//
//ACS_DI2(Задание_0,"Задание_0")
//ACS_DI2(Задание_25,"Задание_25")
//ACS_DI2(Задание_50,"Задание_50")
//ACS_DI2(Задание_75,"Задание_75")
//ACS_DI2(Задание_100,"Задание_100")

//ACS_AO2(Положение_клапана, "Положение клапана" )
//ACS_DI2(Клапан_1,"Клапан_1")
//ACS_DI2(Клапан_2,"Клапан_2")
//ACS_DI2(Клапан_3,"Клапан_3")
//ACS_DI2(Кл_1,"Кл_1")
//ACS_DI2(Кл_2,"Кл_2")
ACS_AO2(Мощность, "Мощность" )
ACS_AI2(Задание,"Задание")
//ACS_AO2(Задано,"Задано")
