//---------------------------------------------
TAB("Режим",1)
	PARM( On, "#Работает" )
  PARM( Oborot, "#Обороты" )
	PARM_D( _Oborot, "#Фактические обороты", 1. ); 
	PARM( ST_1._P_in, "#Давление на входе(и)" );
	PARM( ST_1._P_out, "#Давление на выходе(и)" );
	PARM( ST_1._T_in, "#Температура на входе" );
	PARM( ST_1._T_out, "#Температура на выходе" );
  PARM( ST_1._Flow_m3, "#Поток нм3" );
  PARM( ST_1._Flow_kg, "#Поток кг" );
	PARM( ST_1._Pow_MWt, "#Мощность МВт" );
//	PARM( ST_1._Flow_lose, "#Потери потока м3" );
	//
ETAB
TAB("Конструктив",1)
	PARM( ST_1.Flow_Nom_m3, "Номинальная подача м3" );
ETAB
//=============================================
TAB("Параметры",1)
//	PARM_B( Set_100, "Производительность 100", true )
//	PARM( ST_1.kFlow_Nom, "Поправка к подаче" );
  PARM( ST_1.Thermo.Gamma, "Gamma газа" );
	PARM( ST_1.Eps, "Паразитный объем" );
	PARM( ST_1.KPD, "КПД термодинамический %" );
  PARM( ST_1.KPD_mech, "КПД механический %" );
  PARM_D( P_in_Z, "Заданное давление на всасе(и)", 0. )
  PARM_D( Omega_P_in_Z, "Проходимость для выравнивания компрессоров", 10000. )
  PARM( ST_1.k_Flow, "Сглаживание потока" );
ETAB
TAB("Привод",1)
PARM_D( Tau_Задание, "Время разгона, с", 10. );
PARM_B( Electro_6000,"Питание 6000V", false )
PARM_D( A_Ток, "Рабочий ток, A/МВт", 200. );
PARM_D( B_Ток, "Пусковой ток, A", 100. );
PARM_S( Мотор, 32, "#Двигатель", "" )
//PARM_D( Ном_Нагрузка, "Номинальная нагрузка, МВт", 0.25 )
ETAB
TAB("Охлаждение",1)
  PARM( ST_1.K_heat, "Коэффициент теплопередачи" );
  PARM( ST_1.S_heat, "Площадь теплообмена" );
  PARM( ST_1.Рубашка.Cp_Corp_Vol, "Теплоемкость корпуса" );
  PARM_D( Omega_Water, "Проходимость по охладителю", 100. );
  //TAB("Температуры",1)
  //  PARM_D( k_Cool,"Охлаждение цилиндров", 5. )
  //  PARM_D(kT_gas_in,"kТ газа на входе", 1.)
  //  PARM_D(kT_gas_out,"kТ газа на выходе", 1.)
  //ETAB
ETAB
TAB("Настройки",1)
  PARM_D( Flow_nm3, "#Заданная подача нм3", 0. );
  PARM( ST_1.Thermo.T_out_max, "max Т выхода" );
  //    PARM( ST_1.Thermo.T_out_min, "min Т выхода");
ETAB
//TAB("Загазованность",1)
//  PARM_S( Room, 32, "Помещение", "" );
//	PARM_S( SensRoom, 64, "Датчики", "" );
//ETAB
//	PARM_D( Min_Задание, "Минимальная производительность, %", 15. );
	PARM_B(bDefect, "Показать отказы", false)
//	PARM_B(bGamma, "Расчет Gamma", false)
TAB("Блокировки",1)
	PARM_B( LocalBlk, "#Локальные блокировки", false );
	PARM_B( ErrInBlk, "#Срабатывание блокировки", false );
	PARM( Err_BlkInObj, "#Срабатывание блокировки в ..." )
ETAB
//
