TAB("Режим", 1)
PARM( ShowValue, "#Показания(разм)" );
PARM_I ( MesZ, "Единицы измерения", -1 )
PARM_B( IsSign_H, "Сработала сигнализация по максимуму", false );
PARM_B( IsSign_L, "Сработала сигнализация по минимуму", false );
PARM_B( IsBlk_H, "Сработала блокировка по максимуму", false );
PARM_B( IsBlk_L, "Сработала блокировка по минимуму", false );
ETAB
TAB("Параметры", 1)
PARM_S( Ref, 64, "Ссылка", "" );
PARM_D( VH, "Верх шкалы", 10000. );
PARM_D( VL, "Низ шкалы", -10000. );
PARM_D( Sign_H, "Верх сигнализации", 10000. );
PARM_D( Sign_L, "Низ сигнализации", -10000. );
PARM_D( Blk_H, "Верх блокировки", 10000. );
PARM_D( Blk_L, "Низ блокировки", -10000. );
PARM_D( Gain, "Множитель", 1. );
PARM_D( Bias, "Смещение", 0. );
ETAB