//PARM( IsFire, "#Горит" );
TAB("Параметры",1)      
PARM_D( _T_fire, "#Температура пламени", 0. );
//PARM_D( _L, "#Уровень %", 0. );
//PARM_D( Sigma, "Излучение", 0. );
//PARM_D( kRazr, "Разряжение", 1e-5 );
PARM_D( OmegaTopl, "Проходимость по топливному газу", 10. );
PARM_D( OmegaGas, "Проходимость входа сжигаемого газа", 10. );
PARM_D( OmegaSteam, "Проходимость входа пара", 10. );
//PARM_D( Vol, "Объем м3", 1. )
//PARM_D( KS, "KS нагревателя", 10000. )
//PARM_D( kkO2, "kO2", 0.15 )
ETAB

