INT_REG(Reg_Speed, "Обороты|Обороты")
ACS_AI(Задание, "Задание", "Задание" )
ACS_AO(Мощность, "Мощность", "Мощность" )
ACS_AO(Обороты, "Обороты", "Обороты" )
ACS_AO(Ток, "Ток", "Ток" )
ACS_DO(Авария, "Авария", "Авария" )
ACS_DI(Пуск, "Пуск", "Пуск")
ACS_DI (Пуск_Стоп,"Пуск/Стоп","Пуск(1)/Стоп(0)")
ACS_DO(Работает, "Состояние", "Состояние" )
ACS_DI(Стоп, "Стоп", "Стоп" )

ACS_DO2(Дистанционный, "Дистанционный" )
ACS_DO2(Дистанционное_управление, "Дистанционное_управление" )
ACS_DI2(Дист_с_РСУ, "Дист с РСУ") 
ACS_DO2(Готовность, "Готовность" )
ACS_DO2(ЧП,"ЧП")
ACS_DO2(БП,"БП")
ACS_DO2(Неисправность_ПЧ,"Неисправность ПЧ")

//
ACS_DI2(Пуск_2, "Пуск_2" )
ACS_DI2(Пуск_3, "Пуск_3" )
ACS_DI2(Стоп2, "Стоп2" )
ACS_DI2(Стоп_2, "Стоп_2" )
ACS_DI2(Стоп_3, "Стоп_3" )
ACS_DI2(Пуск_разрешен, "Разрешение" )
ACS_DI2(Запрет_пуска, "Запрет пуска" )
//
//
ACS_AI(Задание_по_месту,"Задание по месту","Задание по месту")
//

ACS_DO2(Пуск_зеленый,"Пуск зеленый")
ACS_DO2(Пуск_возможен, "Пуск возможен" )
ACS_DO2(Фаза_пуска_5, "Фаза пуска 5" )
ACS_DO2(Фаза_пуска_1, "Фаза пуска 1" )

ACS_AI(Угол_атаки,"Угол_атаки","Угол атаки лопастей вентилятора")



