//
//NODE_IN_M(0,"in_product","Вход нагреваемого продукта")
//NODE_OUT_M(0,"out_product","Выход нагреваемого продукта")
//
//NODE_IN(1, "in_topgas", "Подача топливного газа" )
//NODE_IN(2, "in_pilot", "Подача пилотног газа" )
//NODE_IN(3, "in_air", "Подача воздуха" )
//NODE_IN(4, "in_mazut", "Подача мазута" )
//NODE_IN(5, "in_steam", "Подача пара на распыл мазута" )
//NODE_IN(6, "in_par_topka", "Подача пара в топку" )
//NODE_IN(7, "in_add", "Дополнительный вход горючих материалов" )
//NODE_OUT(8, "out_smoke", "Выход дыма" )
