//TAB("/Параметры",3)
	PARM_D( Omega, "Проходимость охлаждения", 100. )
	PARM_D( Tau_cool, "Инерционность охлаждения", 120.0 )
	PARM_D( T_room, "Номинальная Т корпуса", 20. ) //0 - Tair
	PARM_D( T_oilZ, "Номинальная Т подшипника", 20.0)	// В конструкторе задается рандомом
	PARM_D( T_max, "Максимальная Т подшипника", 120. )
	PARM_B( Use_Tz, "#Настроить подшипники", false )
MODEL("Смазка",true)
	DEFECT(Перегрев,"Перегрев подшипника");
		DEF_D(Нагрев, "Отн. нагрев.", 2., 1., 10.)
	//TAB("Модули",5)
/////////////////////////////////////////////////////////
