ACS_AO(Положение, "Положение", "Положение")

INT_REG( Reg_FlowZad_mol, "Поток моль|Поток вещества через задвижку, кмоль/час" ) 
INT_REG( Reg_FlowZad_nm3, "Поток нм3|Поток газа через задвижку, нм3/час" ) 
INT_REG( Reg_FlowZad_m3, "Поток м3|Поток жидкости через задвижку, м3/час" ) 
INT_REG( Reg_FlowZad_kg, "Поток kg|Поток вещества через задвижку, кг/час" ) 
INT_REG( Reg_P_in_Zad, "Входное Р(и)|Давление перед задвижкой (по потоку), кг/см2" )
INT_REG( Reg_P_out_Zad, "Выходное Р(и)|Давление за задвижкой (по потоку), кг/см2" ) 
INT_REG( Reg_dP_Zad, "Перепад|Перепад на задвижке, кг/см2" )