//---------------------------------------------
TAB("Режим",1)
PARM_D( _P, "#Давление(а)", 0. );
PARM_D( _T, "#Температура", 0. );
PARM_D( _Lev_liq, "#Уровень %", 0. );
PARM_D( _M_Liq, "#Масса жидкости моль", 0. );
PARM_D( _M_liq_kg, "#Масса жидкости кг", 0. );
PARM_D( _M_Gas, "#Масса газа моль", 0. );
PARM_D( _dMdt_mol, "#dMdt моль", 0. );
PARM_D( _Hs_in, "#Поток энтальпии на входе", 0. );
ETAB
//
TAB("Параметры",1)
PARM_D( Vol, "Объем", 10. );
PARM_D( Cp_liq, "Теплоемкость жидкости", 100. );
PARM_D( Cp_corp, "Теплоемкость корпуса", 1000. );
PARM_D( Vol_Gas, "Отн. газовый объем", 1. );
PARM_L( TypeVol, "Тип емкости", "Вертикальная;Горизонтальная;" );
//
PARM_D( Ro_liq, "Плотность жидкости", 1000. );
PARM_D( D_trub, "Отн. диаметр труб", 0.03 );
PARM_D( M_korp_t, "Масса корпуса т", 0.5 );
PARM_D( Подпор, "Подпор", 0. );
PARM_D( k_Cool, "Охлаждение", 0. );
PARM_D( Q_Cool, "#Тепло на охлаждение", 0. );
PARM( Q_ext, "#Внешнее тепло" );
PARM( Slow_Mgas, "Замедление давления" );
ETAB
TAB("Дополнение",7)
PARM_D( _Sliv_kg, "#Слив кг", 0. );
PARM_D( _k_dt, "#Замедление", 0. );
PARM_B( SetOmegaL, "Сжатие газа жидкостью", false );
PARM_D( LevMax, "Максимальный абс. уровень", 1.5 );
PARM_D( LevMin, "Минимальный уровень %", 0. );
PARM_D( Max_dM, "Макс. отн. изм. массы", 0.05 );
PARM_D( KSi_P, "Замедление давления", 1. );
PARM_D( kToAtm, "Связь с атмосферой", 0. );
PARM_D( kToAir, "Охлаждение", 0. );
PARM_B( Calc_kToAir, "Расчет охлаждения", false );
PARM_D( T_min, "Минимальная T", -40. );
PARM_D( T_max, "Максимальная T", 1000. );
PARM_D( P_in, "Давление входа(Pin)", 1. );
PARM_I( nP_in, "№ входа с Pin", -1 );
PARM_I( Залить, "#Залить", 0 );
PARM_B( Учет_полимера, "В уровнях учитывать полимер", false );
ETAB
TAB("Задания",3)
PARM_D( T_Z, "Заданная температура", 0. );
PARM_D( dH_Z, "#Доп. нагрев", 0. );
PARM_D( dSteam_kg, "#Доп. пар кг", 0. );
PARM_D( P_Z, "Заданное давление(и)", -2. );
PARM_D( FlowGas_P_Z, "#Стравливание газа моль", 0. );
PARM_D( VolZ, "Заданный объем", 0. );
PARM_D( Vol2F, "Объем отстойника", 1. );
//PARM_B( OutFlow, "#Вывод потоков", false );
PARM_D( LevZ, "Заданный уровень %", 0. );
PARM_D ( Lev_Opt, "Опт. уровень", 0. );
PARM_D ( Max_Flow_Add, "Макс. долив, кг", 0. );
ETAB

TAB("Баланс",5)
PARM_I( n_Balance, "#N компоненты", -1 )
PARM_D( Balance_in, "#Вход", 0. )
PARM_D( Balance_out, "#Выход", 0. )
PARM_D( Balance_dM, "#Накопление", 0. )
PARM_D( Balance, "#Баланс", 0. )
PARM_D( Balance_in_S, "#Суммарный вход", 0. )
PARM_D( Balance_out_S, "#Суммарный выход", 0. )
PARM_D( Balance_dM_S, "#Суммарное накопление", 0. )
PARM_D( Balance_S, "#Суммарный баланс", 0. )
PARM_D( Balance_H_in_S, "#Суммарная энергия на вход", 0. )
PARM_D( Balance_H_out_S, "#Суммарная энергия на выход", 0. )
PARM_D( Balance_H_dM_S, "#Суммарное накопление энергии", 0. )
PARM_D( Balance_H_S, "#Суммарный баланс энергии", 0. )
ETAB
//////////////////////////////////////////////////////////////////////
//DEFECT(Исправен,"Исправен")
DEFECT(Опустошение,"Опустошение")
DEFECT(Переполнение,"Переполнение")
DEFECT(Уход_уровня,"Уход уровня")
	DEF_D( Def_Low_level, "Остаточный уровень %", 1., 0., 100. )
//DEFECT(Разрушение,"Разрушение")
DEFECT( Разгерметизация_сверху,"Разгерметизация верха")
DEFECT( Разгерметизация_снизу,"Разгерметизация низа")
	PARM_D( Def_Omega_top, "Степень разгерметизации сверху", 0. )
	PARM_D( Def_Omega_bott, "Степень разгерметизации снизу", 0. )
	PARM_D( Def_Hydro_bott, "Гидростат разгерметизации снизу", 1. )
	PARM_D( _Def_Flow_bott, "#Поток разгерметизации снизу кг", 0. )
	PARM_D( _Def_Flow_top, "#Поток разгерметизации сверху нм3", 0. )
