TAB("Режим",0)
	PARM_D( P_In, "#Давление на входе(и)", 0. );
	PARM_D( T_In, "#Температура на входе", 0. );
	PARM_D( P_Out, "#Давление на выходе(и)", 0. );
	PARM_D( T_Out, "#Температура на выходе", 0. );
	PARM_D( dP, "#Перепад", 0. );
	PARM( Flow, "#Поток кмоль" );
	PARM_D( F_kg, "#Поток кг", 0. );
	PARM( Omega, "#Проходимость" );
	PARM_D( УровеньZ,"Заданный уровень", 70. )
ETAB
TAB("Параметры",2)//    0        1          2           3        4       5     6     7      8    9      10             11  12      13				    14
	PARM_L_S( Тип, "Тип", "Дроссель;Гидростат;Нагреватель;Уплотнения;Фильтр;Очистка;Люк;Продувка;МЭА;Состав;Фильтр состава;Поток;dT;Электроподогрев;Сборник;" );
	IF( Тип == 0 || Тип == 4 )
	PARM_D_S( dP_nom, "Номинальный перепад", 0.01 );
	PARM_D_S( Flow_nom_m3, "Номинальный поток нм3", 100000. );
	PARM_D_S( Flow_nom_kg, "Номинальный поток кг", 0. );
	PARM_D_S( K_Rel, "Относительная проходимость", 1. );
	PARM_D_S( dP_Z, "Заданный перепад", 0. );
	PARM_D_S( Flow_Z_m3, "Заданный поток нм3", 0. );
	PARM_D_S( Flow_Z_kg, "Заданный поток кг", 0. );
	PARM_D( Omega_max, "Максимальная проходимость", 10000. );
	PARM_D( Pow_Defect, "Степень влияния засорения", 3.5 );
	ENDIF
	IF( Тип == 1 )
	PARM_D_S( dP_Hydro, "Гидростат F=Pi-Po-dP", 0. );
	ENDIF
	IF( Тип == 2  ||  Тип == 13)
	PARM_D( Q, "Мощность, кВт", 0. );
	PARM_D( TauHeat,"Время нагрева, с", 20.)
	ENDIF
	IF( Тип == 2)
	PARM_D( _Q, "#Мощность, кВт", 0. );
	PARM_D( _q, "#Удельный нагрев кДж/кмоль", 0. );
	PARM_D( _T, "#Температура на выходе", 0. );
	PARM_D( _Eps, "#Доля пара на выходе", -1. );
	PARM_D( q, "Удельный нагрев кДж/кмоль", 0. );
	PARM_D( T, "Температура на выходе", 0. );
	PARM_D( Eps, "Доля пара на выходе", -1. );
  PARM( T_max, "#Макс. температура на выходе" );
  PARM( T_min, "#Мин. температура на выходе" );
	PARM_D( Omega_2, "Проходимость нагревателя", 100. );
	PARM_D( Alfa, "Доля потока на выход", 1. );
	PARM( IsHeat,"Нагреватель включен")
	ENDIF
	IF( Тип == 6 )
	PARM_D_S( Tau_Open, "Время открытия люка, с", 30. );
	ENDIF
	IF( Тип == 7 )
	PARM_D( Tau_Produvka, "Время продувки, мин", 3. );
	PARM_B( Воздух, "Задать воздух", false );
	ENDIF
	IF( Тип == 8 || Тип == 9 )
	PARM_D( delta_Flow, "Добавка потока, %", 0. );
	ENDIF
	IF( Тип == 12 )
	PARM_D( dT_max, "Максимальная dT", 6. );
	PARM_D( T_start_heat, "T начала подогрева", 150. );
	PARM_D( T_max_heat, "T макс. подогрева", 200. );
	ENDIF
ETAB
TAB("Отказы", 1 )
	PARM_B( IsDefects, "Есть отказы", true );
	PARM_S( DefModel, 32, "Оборудование", "Фильтры" );
	PARM_S( DefDefect, 48, "Отказ", "Засорение фильтра" );
	PARM_S( DefValue, 48, "Степень", "Степень засорения, %" );
	PARM_B( IsZagaz, "Есть загазованность", false );
ETAB

