//
F_AO(Разряжение_в_поде,"Разряжение_в_поде")
F_AO(Разряжение_на_перевале,"Разряжение_на_перевале")
F_AO(Разряжение_на_перевале_1,"Разряжение_на_перевале_1")
F_AO(Разряжение_на_перевале_2,"Разряжение_на_перевале_2")
F_AO(Отрицательное_разряжение,"Отрицательное_разряжение")
F_AO(P_дыма_Па,"P_дыма_Па")
F_AO(О2_в_дыме,"О2_в_дыме")
F_AO(CO_в_дыме,"CO_в_дыме")
F_AO(CH_в_дыме,"CH_в_дыме")
F_AO(Т_в_камере_радиации_1,"Т_в_камере_радиации_1")
F_AO(Т_в_камере_радиации_2,"Т_в_камере_радиации_2")
F_AO(Т_стен,"Т_стен")

F_AO(Т_на_перевале,"Т_на_перевале")
F_AO(Т_на_перевале_1,"Т_на_перевале_1")
F_AO(Т_на_перевале_2,"Т_на_перевале_2")
F_AO(Т_на_перевале_3,"Т_на_перевале_3")
F_AO(Т_на_перевале_4,"Т_на_перевале_4")
F_AO(Т_на_перевале_5,"Т_на_перевале_5")
F_AO(Т_на_перевале_6,"Т_на_перевале_6")
//


