TAB("Режим", 1 )
  PARM_D( P_In, "#Давление на входе", 0. )
  PARM_D( P_Out, "#Давление на выходе", 0. )
  PARM_D( _dP, "#Перепад", 0. )
  PARM_D( F, "#Поток, моль", 0. )
  PARM_D( F_nm3, "#Поток, нм3", 0. )
  PARM_D( F_kg, "#Поток, кг", 0. )
  TAB("Нелинейность", 1 )
    PARM( Pin, $"#Давление на входе(а)" )
    PARM( Pout, $"#Давление на выходе(а)" )
    PARM( Перепад.Re, "#Re" )
    PARM( Перепад.Xi_Flow, "#Поправка" )
  ETAB
ETAB
//---------------------------------------------
TAB("Параметры", 1 )
  PARM_D( Dy, "Ду", 50. )
  PARM_D( Omega_Fwd, "Коэффициент проходимости", 1. )
  PARM_D( Omega_Back, "Обратная проходимость", 1e-7 )
  PARM_D( k_Ksi, "Скорость закрытия", 1. )
  PARM_B( Reverse, "Инверсия", false )
  PARM_B( GasKlap, "Газовый клапан", true )
  TAB("Поток-газ", 1 )
    PARM_D( P_gas, "Давление газа(и)", 10. )
    PARM_D( dP_gas, "Перепад по газу", 0.1 )
    PARM_D( F_gas, "Поток газа", 10000. )
    PARM_D( T_gas, "Температура газа", 20. )
  ETAB
  TAB("Поток-жидкость", 1 )
    PARM_D( dP_liq, "Перепад по жидкости", 0.1 )
    PARM_D( F_liq, "Поток жидкости", 100. )
    PARM_D( T_liq, "Температура жидкости", 20. )
  ETAB
ETAB
