ACS_AI(Задание, "Задание", "Задание")
ACS_AO(Температура_входа, "Температура входа", "Температура_входа")
ACS_AO(Температура_выхода, "Температура выхода", "Температура выхода")
ACS_AO(Ток, "Ток", "Ток")
ACS_DO(Авария, "Авария", "Авария")
ACS_DO(Дистанционное_управление , "Дистанционное управление", "Дистанционное управление")
ACS_DI(Дистанционный, "Дистанционный", "Дистанционный")
ACS_DI(Запрет_пуска, "Запрет пуска", "Запрет пуска")
ACS_DI(Пуск, "Пуск", "Пуск")
ACS_DI(Стоп, "Стоп", "Стоп")
ACS_DI(Пуск_Стоп, "Пуск/Стоп", "Пуск/Стоп")
ACS_DO(Состояние, "Состояние", "Состояние")


INT_REG(Reg_T_Zad, "Заданная Т")
// 
// 
// 
// 
// 
// 
// (Стоп_Р, "Стоп_Р", "Стоп_Р")
