#include "stdafx.h"
#include "Common.h"
#include <string>
#include <cstdio>

ОПИСАНИЕ

//Пусковой рецикл бензина\\

Dbl P3006A_Koef = "V-3003_ЗКЛ_ЗАГЛ_НО_10692.Коэффициент проходимости";
Dbl P3006S_Koef = "V-3003_ЗКЛ_ЗАГЛ_НО_10864.Коэффициент проходимости";
Int Script_ON = "HV-034.Обратный клапан";
Dbl Flow = "HV-034.#Массовый расход";

//Ребойлер T-3003\\

Dbl T3003_L = "T-3003.Уровень в кубе (истинный), %";
Dbl E3005_K = "E-3006.Проходимость трубная";

//Производительность P-3002\\

Dbl P3002A_F1 = "Р-3002А1.Массовый расход, кг/ч";
Dbl P3002A_F2 = "Р-3002А2.Массовый расход, кг/ч";
Dbl P3002A_F3 = "Р-3002А3.Массовый расход, кг/ч";
Dbl P3002A_F4 = "Р-3002А4.Массовый расход, кг/ч";

Dbl P3002S_F1 = "Р-3002S1.Массовый расход, кг/ч";
Dbl P3002S_F2 = "Р-3002S2.Массовый расход, кг/ч";
Dbl P3002S_F3 = "Р-3002S3.Массовый расход, кг/ч";
Dbl P3002S_F4 = "Р-3002S4.Массовый расход, кг/ч";

Dbl P3002A_D1 = "Р-3002А1_дозатор.#Положение";
Dbl P3002A_D2 = "Р-3002А2_дозатор.#Положение";
Dbl P3002A_D3 = "Р-3002А3_дозатор.#Положение";
Dbl P3002A_D4 = "Р-3002А4_дозатор.#Положение";

Dbl P3002S_D1 = "Р-3002S1_дозатор.#Положение";
Dbl P3002S_D2 = "Р-3002S2_дозатор.#Положение";
Dbl P3002S_D3 = "Р-3002S3_дозатор.#Положение";
Dbl P3002S_D4 = "Р-3002S4_дозатор.#Положение";

//Производительность P-3029\\

Dbl P3029A_F = "Р-3029A.Массовый расход, кг/ч";
Dbl P3029A_D = "Р-3029A_дозатор.#Положение";

Dbl P3029S_F = "Р-3029S.Массовый расход, кг/ч";
Dbl P3029S_D = "Р-3029S_дозатор.#Положение";

//Производительность P-3032\\

Dbl P3032A_F = "Р-3032A.Массовый расход, кг/ч";
Dbl P3032A_D = "Р-3032A_дозатор.#Положение";

Dbl P3032S_F = "Р-3032S.Массовый расход, кг/ч";
Dbl P3032S_D = "Р-3032S_дозатор.#Положение";

//Производительность P-3033\\

Dbl P3033A_F = "Р-3033A.Массовый расход, кг/ч";
Dbl P3033A_D = "Р-3033A_дозатор.#Положение";

Dbl P3033S_F = "Р-3033S.Массовый расход, кг/ч";
Dbl P3033S_D = "Р-3033S_дозатор.#Положение";

//T905A\\

Dbl T_905A = "T905A.Корректирующее слагаемое";
Dbl T_910 = "Н-3001.#T перевала";

//R-3001\\

Dbl R3001_BYPASS = "R-3001_BYPASS.#Положение";
Dbl R3001_PASS = "R-3001_PASS.#Положение";
Dbl R3001_PASS_K = "R-3001_PASS.Коэффициент проходимости";
Dbl T_031A = "T031A.#Показания(разм)";

//Печь H-3001\\

Dbl T_H3001 = "Н-3001.#T перевала";
Dbl P_H3001 = "Н-3001.Инерционность перевала, мин";
Int F1_H3001 = "Н-3001.#1 - Горелка горит";
Int F2_H3001 = "Н-3001.#2 - Горелка горит";
Int F3_H3001 = "Н-3001.#3 - Горелка горит";
Int F4_H3001 = "Н-3001.#4 - Горелка горит";
Int Script_ON1 = "Н-3001.BP";

//Температуры змеевиков\\

Dbl T_028A = "T028A.#Показания(разм)";
Dbl T_028B = "T028B.#Показания(разм)";
Dbl T_028C = "T028C.#Показания(разм)";
Dbl T_028D = "T028D.#Показания(разм)";

Dbl T_906A = "T906A.Корректирующее слагаемое";
Dbl T_906B = "T906B.Корректирующее слагаемое";
Dbl T_906C = "T906C.Корректирующее слагаемое";
Dbl T_906D = "T906D.Корректирующее слагаемое";

Dbl T_907A = "T907A.Корректирующее слагаемое";
Dbl T_907B = "T907B.Корректирующее слагаемое";
Dbl T_907C = "T907C.Корректирующее слагаемое";
Dbl T_907D = "T907D.Корректирующее слагаемое";

Dbl T_908A = "T908A.Корректирующее слагаемое";
Dbl T_908B = "T908B.Корректирующее слагаемое";
Dbl T_908C = "T908C.Корректирующее слагаемое";
Dbl T_908D = "T908D.Корректирующее слагаемое";

Dbl T_909A = "T909A.Корректирующее слагаемое";
Dbl T_909B = "T909B.Корректирующее слагаемое";
Dbl T_909C = "T909C.Корректирующее слагаемое";
Dbl T_909D = "T909D.Корректирующее слагаемое";

//Нагрев колонн на пуске\\

Dbl T3001_T3 = "T-3001/Колонна.#Температура жидкости т. 3";
Dbl T3001_K = "T-3001.Конденсация газа";

Dbl T3003_T3 = "T-3003/Колонна.#Температура жидкости т.10";
Dbl T3003_K = "T-3003.Конденсация газа";

Dbl F031 = "F031.#Показания(разм)";
Dbl F038 = "F038.#Показания(разм)";

//Редукторы PCV\\

Int PCV_A = "PCV-784.Задается давление ЗА";
Dbl PUMP1_A = "C-3001A-P1.#Относительные обороты";
Dbl PUMP2_A = "C-3001A-P1S.#Относительные обороты";

Int PCV_S = "PCV-884.Задается давление ЗА";
Dbl PUMP1_S = "C-3001S-P1.#Относительные обороты";
Dbl PUMP2_S = "C-3001S-P1S.#Относительные обороты";

СКРИПТ(Скрипт)

//Пусковой рецикл бензина\\

if (Script_ON == 1)
{
	if (Flow > 10)
	{
		P3006A_Koef = 0.1;
		P3006S_Koef = 0.1;
	}
	else
	{
		P3006A_Koef = 0.01;
		P3006S_Koef = 0.01;
	}
}

//Ребойлер T-3003\\

double k = 0.025;

if ( T3003_L > 10 И T3003_L < 30 )
E3005_K = k * (T3003_L - 10);

else if ( T3003_L <= 10 )
E3005_K = 0;

else
E3005_K = 0.5;

//Производительность P-3002\\

double Q = 334; //максимальная производительность, кг/ч

P3002A_F1 = 0.01 * P3002A_D1 * Q;
P3002A_F2 = 0.01 * P3002A_D2 * Q;
P3002A_F3 = 0.01 * P3002A_D3 * Q;
P3002A_F4 = 0.01 * P3002A_D4 * Q;

P3002S_F1 = 0.01 * P3002S_D1 * Q;
P3002S_F2 = 0.01 * P3002S_D2 * Q;
P3002S_F3 = 0.01 * P3002S_D3 * Q;
P3002S_F4 = 0.01 * P3002S_D4 * Q;

//Производительность P-3029\\

double Q29 = 100; //максимальная производительность, кг/ч

P3029A_F = 0.01 * P3029A_D * Q29;
P3029S_F = 0.01 * P3029S_D * Q29;

//Производительность P-3032\\

double Q32 = 140; //максимальная производительность, кг/ч

P3032A_F = 0.01 * P3032A_D * Q32;
P3032S_F = 0.01 * P3032S_D * Q32;

//Производительность P-3033\\

double Q33 = 500; //максимальная производительность, кг/ч

P3033A_F = 0.01 * P3033A_D * Q33;
P3033S_F = 0.01 * P3033S_D * Q33;

//T905A\\

if (T_910 > 15)
T_905A = 15 + T_910 * 1.093;
else
T_905A = 15;

//R-3001\\

double T0 = 400; //Температура начала реакции, град ц.
double T1 = 420; //Температура активной фазы реакции, град ц.

if (T_031A < T0)
{
	R3001_BYPASS = 100;
	R3001_PASS = 0;
	R3001_PASS_K = 10;
}
else if (T_031A > T1)
{
	R3001_BYPASS = 0;
	R3001_PASS = 100;
	R3001_PASS_K = 100;
}
else
{
	R3001_BYPASS = 100 * (T1 - T_031A) / (T1 - T0);
	R3001_PASS = 100 - R3001_BYPASS;
	R3001_PASS_K = 10;
}

//R3001_PASS_K = R3001_PASS;

//Печь H-3001\\

int F_H3001 = 0;

if (F1_H3001 == 1 ИЛИ F2_H3001 == 1 ИЛИ F3_H3001 == 1 ИЛИ F4_H3001 == 1)
F_H3001 = 1;
else
F_H3001 = 0;

if (Script_ON1 == 0)
{
	if (T_H3001 < 50 И F_H3001 == 0)
		P_H3001 = 1;
	if (T_H3001 > 750 И F_H3001 == 1)
		P_H3001 = 100;
}

//Температуры змеевиков\\

if (T_910 > T_028A)
{
	T_906A = 0.5 * (T_028A + T_910);
	T_906C = T_906A * 0.95;
	T_906B = T_906C * 0.95;
	T_906D = T_906B * 0.99;
}
else
{
	T_906A = T_028A;
	T_906C = T_906A;
	T_906B = T_906A;
	T_906D = T_906A;
}

if (T_910 > T_028B)
{
	T_907A = 0.5 * (T_028B + T_910);
	T_907C = T_907A * 0.95;
	T_907B = T_907C * 0.95;
	T_907D = T_907B * 0.99;
}
else
{
	T_907A = T_028B;
	T_907C = T_907A;
	T_907B = T_907A;
	T_907D = T_907A;
}

if (T_910 > T_028C)
{
	T_908A = 0.5 * (T_028C + T_910);
	T_908C = T_908A * 0.95;
	T_908B = T_908C * 0.95;
	T_908D = T_908B * 0.99;
}
else
{
	T_908A = T_028C;
	T_908C = T_908A;
	T_908B = T_908A;
	T_908D = T_908A;
}

if (T_910 > T_028D)
{
	T_909A = 0.5 * (T_028D + T_910);
	T_909C = T_909A * 0.95;
	T_909B = T_909C * 0.95;
	T_909D = T_909B * 0.99;
}
else
{
	T_909A = T_028D;
	T_909C = T_909A;
	T_909B = T_909A;
	T_909D = T_909A;
}

//Нагрев колонн на пуске\\

if (T3001_T3 < 160 И F031 < 10)
T3001_K = 10;
else
T3001_K = 0;

if (T3003_T3 < 120 И F038 < 10)
T3003_K = 10;
else
T3003_K = 0;

//Редукторы PCV\\

if (PUMP1_A > 0.9 ИЛИ PUMP2_A > 0.9)
PCV_A = 0;
else
PCV_A = 1;

if (PUMP1_S > 0.9 ИЛИ PUMP2_S > 0.9)
PCV_S = 0;
else
PCV_S = 1;

КОНЕЦ
