//---------------------------------------------
TAB("Режим",1)
PARM_D( _P_in, "#Давление на входе(и)", 0. )
PARM_D( T_in, "#Температура на входе", 0. )
PARM_D( Flow_mol_in_out, "#Поток кмоль", 0. )
PARM_D( Flow_m3_in_out, "#Поток нм3", 0. )
PARM_D( Flow_kg_in_out, "#Поток кг", 0. )
PARM_D( h_Flow_src, "#Энтальпия потока", 0. )
//
PARM_D( _Eps, "#Доля пара", 0. )
PARM_D( _Mw, "#Молекулярный вес", 0. )
ETAB
//
TAB("Конструктив",1)
  PARM_D( T, "Температура", 20. )
  PARM_D( Pizb, "Давление(и)", 0. )
  PARM_D( Eps, "Доля пара", 0. )
  PARM_S( Composition, 64, "Состав", "" )
  PARM_L( CalcPT, "Расчет", "Нет;Т насыщенного пара;P насыщенного пара;" )
  PARM_L( Параметры, "Параметры", "P+T;P+E;T+E;" )
ETAB
TAB("Параметры",1)      
  PARM_D( Omega, "Проходимоcть", 10000. / mOmega )
  PARM_B( OK, "Обратный клапан", false )
  PARM_D( H_SmokePipe, "Высота конца дымовой трубы", -1. )
  PARM_S( Composition_Defect, 32, "Состав при отказе", "" )
  PARM_B( WorkAsSrc, "Работать как источник", false )
//PARM_U( PropName, "Имя параметра управления", "" )
ETAB
//
//TAB("Настройки",1)
//PARM_D( FlowZ, "Заданный поток, кг", 0. )
//PARM_B( UseFlowZ, "Задавать поток", false )
//PARM_D( dPZ, "Заданный перепад", 0. )
//PARM_B( UsedPZ, "Задавать перепад", false )
//ETAB

TAB("Вывод",1)
PARM_B(Out_P, "Вывод давления(и)", false )
PARM_B(Out_T, "Вывод температуры", false )
PARM_B(Out_F_m3, "Вывод потока нм3", false )
PARM_B(Out_F_kg, "Вывод потока кг", false )
ETAB

//PARM_B( SaveSt, "#Сохранить состояние", false )
//PARM_B( RestStStart, "Прочитать состояние при старте", false )
//PARM_B( RestSt, "#Прочитать состояние", false )

//////////////////////////////////////
TAB("Отказы",5)
MODEL("Ресурсы",true)
DEFECT(Восстановление_работоспособности,"Восстановление работоспособности")
DEFECT(Прекращение_подачи,"Прекращение подачи/приема")
DEFECT(Возобновление_подачи,"Возобновление подачи/приема")
DEFECT(Изменение_давления,"Изменение давления")
  DEF_D(def_P, "Давление", 0., 0., 500. )
DEFECT(Изменение_температуры,"Изменение температуры")
  DEF_D(def_T, "Заданная температура", 15., 15., 100. )
DEFECT(Закупорка,"Закупорка")
DEFECT(Изменение_состава,"Изменение состава")
DEFECT(Восстановление_состава,"Восстановление состава")
ETAB
