TAB("Режим", 1 )
	PARM_D( _Давление_на_выходе, "#Давление_на_выходе(и)", 0. )
	PARM_D( _Температура_на_входе, "#Температура_на_входе", 0. )
	PARM_D( _Температура_на_выходе, "#Температура_на_выходе", 0. )
	PARM_D( _C1_4_на_выходе, "#C1-4 на выходе, вес %", 0. )
	PARM_D( _C1_4_на_выходе_т, "#C1-4 на выходе,т", 0. )
	PARM_D( _C5_T90_на_выходе, "#C5-T90 на выходе", 0. )
	PARM_D( _C5_T90_на_выходе_т, "#C5-T90 на выходе,т", 0. )
	PARM_D( _T90_T170_на_выходе, "#T90-T170 на выходе", 0. )
	PARM_D( _T90_T170_на_выходе_т, "#T90-T170 на выходе,т", 0. )
	PARM_D( _T170_T350_на_выходе, "#T170-T350 на выходе", 0. )
	PARM_D( _T170_T350_на_выходе_т, "#T170-T350 на выходе,т", 0. )
	PARM_D( _T350_T550_на_выходе, "#T350-T550 на выходе", 0. )
	PARM_D( _T350_T550_на_выходе_т, "#T350-T550 на выходе,т", 0. )
	PARM_D( _T550_на_выходе, "#T550 на выходе", 0. )
	PARM_D( _T550_на_выходе_т, "#T550 на выходе,т", 0. )
	PARM_D( _Коксуемость, "#Коксуемость", 0.)
	PARM_D( _Вязкость, "#Вязкость", 0.)
ETAB
TAB("Параметры", 1 )
	PARM_B( On, "Включить", true );
	PARM_D( Omega, "Проходимость", 1e5 );
	PARM_D( T0_C, "Базовая т-ра, С", 450. );
	PARM_D( k_all, "Активность реакций", 1. );
	PARM_B( Порог, "Пороговые реакции", false );
	PARM_D( Flow_nom_t, "Номинальный поток, т/ч", 200. );
	PARM_D ( kPress_gas, "Влияние давления на газы", 0.1 );
	PARM_D ( kPress_1, "Влияние давления на C5-90", 0.01 );
	PARM_D ( kPress_2, "Влияние давления на 90-170", 0.001 );
	PARM_D ( Q_React, "Средняя отн. теплота реакции", 1. );
	PARM_D ( Tau, "Тепловая инерция, мин", 10. );
	PARM_D ( C_H2S, "Выход H2S, моль %", 0. );
	PARM_D ( T_H2S_0, "Т начала выделения H2S", 350. );
	PARM_D ( T_H2S_100, "Т максимального выделения H2S", 450. );
ETAB
TAB("90-170",1)
	PARM_D ( k_20, "k2 в C1-C4", 0. );
	PARM_D ( k_21, "k2 в С5-90", 0. );
	//
	PARM_D ( Max_20, "Макс k2 в C1-C4",  2. );
	PARM_D ( Max_21, "Макс k2 в С5-90",  2. );
ETAB
TAB("170-350",1)
	PARM_D ( k_30, "k3 в C1-C4", 0.1 );
	PARM_D ( k_31, "k3 в С5-90", 0.1 );
	PARM_D ( k_32, "k3 в 90-170", 0.1 );
	//
	PARM_D ( Max_30, "Макс k3 в C1-C4",  2. );
	PARM_D ( Max_31, "Макс k3 в С5-90",  2. );
	PARM_D ( Max_32, "Макс k3 в 90-170", 2. );
ETAB
TAB("350-550",1)
	PARM_D ( k_40, "k4 в C1-C4", 0.1 );
	PARM_D ( k_41, "k4 в С5-90", 0.1 );
	PARM_D ( k_42, "k4 в 90-170", 0.1 );
	PARM_D ( k_43, "k4 в 170-350", 0.1 );
	//
	PARM_D ( Max_40, "Макс k4  в C1-C4", 2. );
	PARM_D ( Max_41, "Макс k4  в С5-90", 2. );
	PARM_D ( Max_42, "Макс k4  в 90-170", 2. );
	PARM_D ( Max_43, "Макс k4  в 170-350", 2. );
ETAB
TAB("550+",1)
	PARM_D ( k_50, "k5 в C1-C4", 0.1 );
	PARM_D ( k_51, "k5 в С5-90", 0.1 );
	PARM_D ( k_52, "k5 в 90-170", 0.1 );
	PARM_D ( k_53, "k5 в 170-350", 0.1 );
	PARM_D ( k_54, "k5 в 350-550", 0.1 );
	PARM_D ( k_56, "k5 в кокс", 0. );
	//
	PARM_D ( Max_50, "Макс k5  в C1-C4", 2. );
	PARM_D ( Max_51, "Макс k5  в С5-90", 2. );
	PARM_D ( Max_52, "Макс k5  в 90-170", 2. );
	PARM_D ( Max_53, "Макс k5  в 170-350", 2. );
	PARM_D ( Max_54, "Макс k5  в 350-550", 2. );
	PARM_D ( Max_56, "Макс k5  в кокс", 2. );
ETAB
//
TAB("Плотности",1)
	PARM_D ( Ro_Pech, "Плотность продукта в печь", 861.43 );
	PARM_D ( TRo_Pech, "Температура в печь", 320. );
	PARM_D ( Ro_React, "Плотность продукта в реактор", 772.72 );
	PARM_D ( TRo_React, "Температура в реактор", 453. );
	PARM_D ( Ro_From_Pech, "#Плотность продукта из печи", 700. );
	PARM_D ( Ro_in, "#Плотность продукта в печь", 700. );
ETAB
